{
  "name": "openam Juju charm",
  "juju_charm_name": "openam",
  "revision": "cs:precise/openam-2",
  "latest": true,
  "uris": [
    "https://jujucharms.com/openam",
    "https://jujucharms.com/openam/precise",
    "https://jujucharms.com/openam/precise/2",
    "https://api.jujucharms.com/v5/openam",
    "https://api.jujucharms.com/v5/precise/openam",
    "https://api.jujucharms.com/v5/precise/openam-2"
  ],
  "labels": [
    "Juju charm",
    "applications",
    "Type/Middleware/Runtime/Java",
    "Binding/Region/Europe/EU",
    "Mode/Executable/Bundle/Juju Charm",
    "Type/Devopsware/Deployment/Juju",
    "Type/Infrastructure/Operating System",
    "Type/Middleware/User Management"
  ],
  "info_url": "https://jujucharms.com/openam",
  "package_url": "https://api.jujucharms.com/v5/precise/openam-2/archive",
  "created": "2015-06-17T09:36:31.757Z",
  "updated": "2015-06-17T09:36:31.757Z",
  "description": "OpenAM - AM made easy and secure for the web\n\nThe only \"all-in-one\" open source access management solution provides the most comprehensive consumer-facing identity relationship management (IRM) services,\nas well as traditional access management capabilities.\nDesigned from inception to provide services for the web, cloud, mobile devices and things, OpenAM has a highly scalable, modular, easy to deploy architecture that includes Authentication, SSO, Authorization, Federation, Entitlements, Adaptive Authentication, Strong Authentication and Web Services Security - in a single, unified product.\n- See more at: http://forgerock.com/products/open-identity-stack/openam\n",
  "maintainer": {
    "name": "charmers"
  },
  "juju_charm_subordinate": false,
  "juju_charm_series": "precise",
  "juju_charm_owner": "charmers",
  "requires": [
    {
      "kind": "host",
      "label": "Infrastructure/Operating System/Linux/Ubuntu",
      "version": "= precise"
    }
  ],
  "parameters": {
    "Accept_license": {
      "type": "boolean",
      "description": "This otions is mandatory.\n.\nYou have to accept the OpenDJ license terms before installation can proceed.\nThe lisence terms can be found as part of the source in file named 'license.txt'.\n",
      "default": false,
      "mapping": "charm_option"
    },
    "Amadmin_password": {
      "type": "string",
      "description": "You have to provide a private OpenAM amadmin password before installation can be done.\nAdministrator password must be atleast 8 characters.\n.\nThe amadmin password will only be set on initial installation, it can not be changed using the charm config after installation.\n.\nThis field is mandatory.\n",
      "default": null,
      "mapping": "charm_option"
    },
    "FQDN_OpenAM_alias": {
      "type": "string",
      "description": "Add this Fully Qualified Domain Name (FQDN) to be a valid hostname supported by OpenAM.\nIf you already have a valid FQDN you wanna use, or by any other reasons need to provide a full hostname enter it here.\nThe default (unit-get public-address) will be used as default but the alias will be added in addition. \n.\nThis field is optional.\n",
      "default": null,
      "mapping": "charm_option"
    },
    "http_port": {
      "type": "int",
      "description": "HTTP port",
      "default": 8080,
      "mapping": "charm_option"
    },
    "https_port": {
      "type": "int",
      "description": "HTTPS port",
      "default": 8443,
      "mapping": "charm_option"
    },
    "java_opts": {
      "type": "string",
      "description": "Java options for JVM",
      "default": "-Xmx1024m -XX:MaxPermSize=256m",
      "mapping": "charm_option"
    }
  },
  "provides": [
    {
      "kind": "peer",
      "uri": "https://jujucharms.com/provides/ldap-v3",
      "juju_interface": "ldap-v3",
      "juju_name": "datastore-dj",
      "juju_role": "provider",
      "juju_limit": 0
    },
    {
      "kind": "peer",
      "uri": "https://jujucharms.com/provides/openam-agent",
      "juju_interface": "openam-agent",
      "juju_name": "openam-agent",
      "juju_role": "provider",
      "juju_limit": 0
    },
    {
      "kind": "peer",
      "uri": "https://jujucharms.com/provides/openidc",
      "juju_interface": "openidc",
      "juju_name": "openidc-discovery",
      "juju_role": "provider",
      "juju_limit": 0
    }
  ],
  "license": "# Overview\n\n##About ForgeRock Open Identity Stack\nForgeRock is pioneering open source identity management through innovation, simplification, and openness for all identity services. Dedicated to democratizing Identity Management for everyone across enterprise, social, mobile, and the cloud, ForgeRock products support mission-critical operations with a fully open source platform. \n\n[ForgeRock’s Open Identity Stack](http://forgerock.com/products/) powers solutions for thousands of the world’s largest companies and government organizations.\n\nOur goal is simple: to deliver the best open source identity stack for securing anything, anywhere, on any device.\n\nThe Open Identity Stack includes the following main products:\n\n- OpenAM is a single, unified access management solution providing authentication, authorization, federation, web services security, fine-grained entitlements, and adaptive authorization all in one self-contained Java application. Included with OpenAM, the Open Identity Gateway (OpenIG) is a high-performance gateway with specialized session management and credential replay functionality. \n\n- OpenDJ is an LDAP directory server — the first-ever directory natively supporting REST — with a flexible access model that lets developers choose between REST, SCIM, LDAP or web services. The 100% Java-based LDAPv3-compliant server is extremely efficient with minimal CPU, memory and on-disk footprint. \n\n- OpenIDM is the only 100% open source, lightweight, user administration and provisioning solution purpose-built for Internet scale. It’s easy to embed and deploy, with a small footprint and out-of-the-box REST interfaces that use standard Java development tools. OpenIDM uses the Open Identity Connectors Framework and Toolkit (OpenICF) to aid development of resource connectors. \n\n##ForgeRock OpenAM\n\nForgeRock OpenAM was designed in response to a milieu of access management suites that were pieced together through acquisitions, creating an accidental architecture that complicates deployment and passes integration costs on to customers. Based on the Sun OpenSSO codebase, OpenAM is an “All-In-One” access management platform for protecting any type of resource across enterprise, cloud, social, and mobile environments. What has traditionally been delivered by legacy identity vendors as six different products — SSO, adaptive authentication, strong authentication, federation, web services security, and ﬁne-grained entitlements — is delivered as a single, uniﬁed offering. Organizations can use the access control services they need and simply “turn on” additional services when ready.\n \nThe solution has an inherently unique architecture to support use cases from complex enterprise access control, to multi-protocol federation, to enabling SSO for cloud systems. At the highest level OpenAM consists in a single, self-contained Java application; service components such as session management; client side APIs in C, Java, REST; service provider interfaces to enable custom plugins; and policy agents for web and app server containers to enforce access policies to protected web sites and web applications. Organizations with existing internal access management solutions can easily integrate OpenAM into their environment through API services or through the token translation service. Maintaining all installation and conﬁguration capabilities within one application vastly simpliﬁes deployment. In addition, agent conﬁguration, server conﬁguration, and other tasks are simpliﬁed to be repeatable and scalable, so multiple instances of the solution can be deployed without additional effort. The embedded OpenDJ directory server eliminates the need to conﬁgure a separate directory to support the conﬁguration and data stores, or if desired, users can utilize other LDAP directories or databases.\n\n**Key OpenAM Features**\n\n- Authentication\nWith over 20 out-of-the-box authentication methods supported, OpenAM has the flexibility to chain methods together along with Adaptive Risk scoring, or to create custom authentication modules based on the JAAS (Java Authentication and Authorization Service) open standard. Windows IWA is supported to enable a completely seamless heterogeneous OS and Web application SSO environment.\n \n- Authorization\nOpenAM provides authorization policy from basic, simple, coarse-grained rules to highly advanced, fine-grained entitlements based on XACML (Extensible Authorization Mark-Up Language). With the ability to abstract authorization policy away from the application, developers can quickly add or change policy as needed without modification to the underlying application.\n \n- Adaptive Risk Authentication \nThe adaptive risk authentication module is used to assess risks during the authentication process, to determine whether to require that the user complete further authentication steps. Adaptive risk authentication determines, based on risk scoring, whether more information from a user is required when they login. For example, a risk score can be calculated based on an IP address range, access from a new device, account idle time, etc., and applied to the authentication chain.\n \n- Federation \nFederation services securely share identity information across heterogeneous systems or domain boundaries using standard identity protocols (SAML, WS-Fed, OpenID Connect). Quickly setup and configure service provider or cloud service connections through the Fedlet, OAUTH2 Client, OAUTH2 Provider, or OpenIG Federation Gateway. Unique to OpenAM, the OpenIG Federation Gateway provides a SAML2 compliant enforcement point to and allows businesses to quickly add SAML2 support to their applications with little to no knowledge of the standard.\n\n- Single Sign-On: OpenAM provides multiple mechanisms for SSO, whether the requirement is enabling cross-domain SSO for a single organization, or SSO across multiple organizations through the Federation Service. OpenAM supports multiple options for enforcing policy and protecting resources, including policy agents that reside on web or application servers, a proxy server, or the OpenIG (Identity Gateway). OpenIG runs as a self-contained gateway and protects web applications where installing a policy agent is not possible.\n \n- High Availability & Session Failover\nTo enable high availability for large-scale and mission-critical deployments, OpenAM provides both system failover and session failover. These two key features help to ensure that no single point of failure exists in the deployment, and that the OpenAM service is always available to end-users. Redundant OpenAM servers, policy agents, and load balancers prevent a single point of failure. Session failover ensures the user’s session continues uninterrupted, and no user data is lost. The high availability of OpenAM is based upon using a load balancing (either software or hardware based) which supports sticky sessions to distribute the load across all available OpenAM server. Should one server become unavailable, the load balancer fails client requests over to another OpenAM server. The other OpenAM server must then fail over the user session associated with the client.\nThe session persistence repository is based on the bundled OpenDJ LDAP server. Recommended setup would be to have a external configuration of the OpenDJ as the session store which can scale and be redundant independent of the number of instances of OpenAM.\n\n## Further documentation \n\n- [Documentation home](http://docs.forgerock.org)\n- [Release note](http://docs.forgerock.org/en/openam/latest/release-notes/index/index.html)\n- [Installation guide](http://docs.forgerock.org/en/openam/latest/install-guide/index/index.html)\n- [Administration guide](http://docs.forgerock.org/en/openam/latest/admin-guide/index/index.html)\n\n## Subscription\n\nForgeRock can offer a subscription for those who want to use ForgeRock products for production.\nCheck out here: [Subscriptions](http://forgerock.com/products/subscriptions/).\n\n# Usage\n\nTo be able to install OpenAM you have to accept the license term as outlined in the license file.\nYou can either accept the license terms on the command line or by the checkbox in the Juju-gui.\n\nIn addition you have to set a \"private\" admin password for your deployment, either on the command line or in the Juju-gui.\n\nStep by step instructions on using the charm\n\n    juju deploy openam --constraints=\"mem=4G arch=amd64\"\n\tjuju set openam Accept_license='true' Amadmin_password='cangetin'\n\nIn addition you can also set a FQDN to be added as a alias in addition to the initial default hostname used for installation.\nThe alias host can then be a public resolvable FQDN or a name only resolvable on the local host. All Juju relationships will use the default initial returned by the 'unit-get public-address' function.\n\n\tjuju set openam FQDN_OpenAM_alias='my-host.mydomain.com';\n\nThe instance running OpenAM needs at least 4GB RAM.\n\nThis relase of the OpenAM charm supports a Juju relationship to ForgeRock OpenDJ. OpenDJ is a LDAP directory server, which in most cases are used as user repositories. OpenDJ comes with some sample users that can be added to the default authentication chain in OpenAM to test and verify how easy such a integration can be done. You can verify the users in the OpenAM web console in the following location both with and without a relationship:\n\n- 'Access Control' -> '/ (Top Level Realm)' -> 'Subjects'\n\nThe datastore itself is created in \n\n- 'Access Control' -> '/ (Top Level Realm)' -> 'Data stores'\n\nand named 'opendj'.\n\nMany more relationships for both datastores and authentication services will be added in the future. \nAny contributions are welcome.\n\n## Scale out Usage\n\nOpenAM itself is highly scalable using built-in a site configuration option and can be used behind load balancers. This release of OpenAM do support it, but the autoscaling features supported by Juju is not currently mapped a OpenAM site configurations.\n\n## Known Limitations and Issues\n\nThis release of OpenAM is meant for evaluation purposes only and will violate the license terms if used in a production environment. There is no limitation in features of the product.\n\nThe 'unit-get public-address' call in Juju install hook needs to return a Fully Qualified Domain Name (FQDN), just an IP address will abort the installation if no FQDN alias is used.\n\nThe 'amadmin' password will only be set on initial installation. It is not supported to change it from within Juju with the current version of this charm.\n\nOther limitations for this charm:\n- Autoscaling is not supported in this charm release. You can add and configure it manually if needed.\n- Using privileged ports (low ports numbers) are not supported\n- Only OpenDJ is tested as a user repository for authenticate users\n- Only the Apache OpenAM Agent relationship is currently supported. Currently no support for the .Net and J2EE agents.\n- Only OpenID Connect is supported as a automatically way of authenticate users of any charm implementing the same interface \n\nThere will be more features and relationships to come.\n\n# Configuration\n\nIn addition to the license agreement and the admin password you can change or set the following configuration options.\n\nOpenAM uses the default Tomcat7 as it's java container for deployment. Default ports are 8080 and for SSL 8443 is used. There is a self-signed certificate created for SSL.\n\n- http_port, defaults to 8080\n- https_port, defaults to 8443\n- java_opts, defaults to '-Xmx1024m -XX:MaxPermSize=256m'\n\nYou can then browse to http://ip-address:8080 or https://ip-address:8443 to further configure OpenAM. Default admin user is \"amadmin\" and password is the one defined on deployment.\n\n# Contact Information\n\n- Stein Myrseth <stein.myrseth@forgerock.com>\n- [Github](https://github.com/justme99/juju)\n\n## ForgeRock\n- [ForgeRock Homepage](http://forgerock.com)\n- [ForgeRock Community](http://forgerock.org)\n",
  "readme": "# Overview\n\n##About ForgeRock Open Identity Stack\nForgeRock is pioneering open source identity management through innovation, simplification, and openness for all identity services. Dedicated to democratizing Identity Management for everyone across enterprise, social, mobile, and the cloud, ForgeRock products support mission-critical operations with a fully open source platform. \n\n[ForgeRock’s Open Identity Stack](http://forgerock.com/products/) powers solutions for thousands of the world’s largest companies and government organizations.\n\nOur goal is simple: to deliver the best open source identity stack for securing anything, anywhere, on any device.\n\nThe Open Identity Stack includes the following main products:\n\n- OpenAM is a single, unified access management solution providing authentication, authorization, federation, web services security, fine-grained entitlements, and adaptive authorization all in one self-contained Java application. Included with OpenAM, the Open Identity Gateway (OpenIG) is a high-performance gateway with specialized session management and credential replay functionality. \n\n- OpenDJ is an LDAP directory server — the first-ever directory natively supporting REST — with a flexible access model that lets developers choose between REST, SCIM, LDAP or web services. The 100% Java-based LDAPv3-compliant server is extremely efficient with minimal CPU, memory and on-disk footprint. \n\n- OpenIDM is the only 100% open source, lightweight, user administration and provisioning solution purpose-built for Internet scale. It’s easy to embed and deploy, with a small footprint and out-of-the-box REST interfaces that use standard Java development tools. OpenIDM uses the Open Identity Connectors Framework and Toolkit (OpenICF) to aid development of resource connectors. \n\n##ForgeRock OpenAM\n\nForgeRock OpenAM was designed in response to a milieu of access management suites that were pieced together through acquisitions, creating an accidental architecture that complicates deployment and passes integration costs on to customers. Based on the Sun OpenSSO codebase, OpenAM is an “All-In-One” access management platform for protecting any type of resource across enterprise, cloud, social, and mobile environments. What has traditionally been delivered by legacy identity vendors as six different products — SSO, adaptive authentication, strong authentication, federation, web services security, and ﬁne-grained entitlements — is delivered as a single, uniﬁed offering. Organizations can use the access control services they need and simply “turn on” additional services when ready.\n \nThe solution has an inherently unique architecture to support use cases from complex enterprise access control, to multi-protocol federation, to enabling SSO for cloud systems. At the highest level OpenAM consists in a single, self-contained Java application; service components such as session management; client side APIs in C, Java, REST; service provider interfaces to enable custom plugins; and policy agents for web and app server containers to enforce access policies to protected web sites and web applications. Organizations with existing internal access management solutions can easily integrate OpenAM into their environment through API services or through the token translation service. Maintaining all installation and conﬁguration capabilities within one application vastly simpliﬁes deployment. In addition, agent conﬁguration, server conﬁguration, and other tasks are simpliﬁed to be repeatable and scalable, so multiple instances of the solution can be deployed without additional effort. The embedded OpenDJ directory server eliminates the need to conﬁgure a separate directory to support the conﬁguration and data stores, or if desired, users can utilize other LDAP directories or databases.\n\n**Key OpenAM Features**\n\n- Authentication\nWith over 20 out-of-the-box authentication methods supported, OpenAM has the flexibility to chain methods together along with Adaptive Risk scoring, or to create custom authentication modules based on the JAAS (Java Authentication and Authorization Service) open standard. Windows IWA is supported to enable a completely seamless heterogeneous OS and Web application SSO environment.\n \n- Authorization\nOpenAM provides authorization policy from basic, simple, coarse-grained rules to highly advanced, fine-grained entitlements based on XACML (Extensible Authorization Mark-Up Language). With the ability to abstract authorization policy away from the application, developers can quickly add or change policy as needed without modification to the underlying application.\n \n- Adaptive Risk Authentication \nThe adaptive risk authentication module is used to assess risks during the authentication process, to determine whether to require that the user complete further authentication steps. Adaptive risk authentication determines, based on risk scoring, whether more information from a user is required when they login. For example, a risk score can be calculated based on an IP address range, access from a new device, account idle time, etc., and applied to the authentication chain.\n \n- Federation \nFederation services securely share identity information across heterogeneous systems or domain boundaries using standard identity protocols (SAML, WS-Fed, OpenID Connect). Quickly setup and configure service provider or cloud service connections through the Fedlet, OAUTH2 Client, OAUTH2 Provider, or OpenIG Federation Gateway. Unique to OpenAM, the OpenIG Federation Gateway provides a SAML2 compliant enforcement point to and allows businesses to quickly add SAML2 support to their applications with little to no knowledge of the standard.\n\n- Single Sign-On: OpenAM provides multiple mechanisms for SSO, whether the requirement is enabling cross-domain SSO for a single organization, or SSO across multiple organizations through the Federation Service. OpenAM supports multiple options for enforcing policy and protecting resources, including policy agents that reside on web or application servers, a proxy server, or the OpenIG (Identity Gateway). OpenIG runs as a self-contained gateway and protects web applications where installing a policy agent is not possible.\n \n- High Availability & Session Failover\nTo enable high availability for large-scale and mission-critical deployments, OpenAM provides both system failover and session failover. These two key features help to ensure that no single point of failure exists in the deployment, and that the OpenAM service is always available to end-users. Redundant OpenAM servers, policy agents, and load balancers prevent a single point of failure. Session failover ensures the user’s session continues uninterrupted, and no user data is lost. The high availability of OpenAM is based upon using a load balancing (either software or hardware based) which supports sticky sessions to distribute the load across all available OpenAM server. Should one server become unavailable, the load balancer fails client requests over to another OpenAM server. The other OpenAM server must then fail over the user session associated with the client.\nThe session persistence repository is based on the bundled OpenDJ LDAP server. Recommended setup would be to have a external configuration of the OpenDJ as the session store which can scale and be redundant independent of the number of instances of OpenAM.\n\n## Further documentation \n\n- [Documentation home](http://docs.forgerock.org)\n- [Release note](http://docs.forgerock.org/en/openam/latest/release-notes/index/index.html)\n- [Installation guide](http://docs.forgerock.org/en/openam/latest/install-guide/index/index.html)\n- [Administration guide](http://docs.forgerock.org/en/openam/latest/admin-guide/index/index.html)\n\n## Subscription\n\nForgeRock can offer a subscription for those who want to use ForgeRock products for production.\nCheck out here: [Subscriptions](http://forgerock.com/products/subscriptions/).\n\n# Usage\n\nTo be able to install OpenAM you have to accept the license term as outlined in the license file.\nYou can either accept the license terms on the command line or by the checkbox in the Juju-gui.\n\nIn addition you have to set a \"private\" admin password for your deployment, either on the command line or in the Juju-gui.\n\nStep by step instructions on using the charm\n\n    juju deploy openam --constraints=\"mem=4G arch=amd64\"\n\tjuju set openam Accept_license='true' Amadmin_password='cangetin'\n\nIn addition you can also set a FQDN to be added as a alias in addition to the initial default hostname used for installation.\nThe alias host can then be a public resolvable FQDN or a name only resolvable on the local host. All Juju relationships will use the default initial returned by the 'unit-get public-address' function.\n\n\tjuju set openam FQDN_OpenAM_alias='my-host.mydomain.com';\n\nThe instance running OpenAM needs at least 4GB RAM.\n\nThis relase of the OpenAM charm supports a Juju relationship to ForgeRock OpenDJ. OpenDJ is a LDAP directory server, which in most cases are used as user repositories. OpenDJ comes with some sample users that can be added to the default authentication chain in OpenAM to test and verify how easy such a integration can be done. You can verify the users in the OpenAM web console in the following location both with and without a relationship:\n\n- 'Access Control' -> '/ (Top Level Realm)' -> 'Subjects'\n\nThe datastore itself is created in \n\n- 'Access Control' -> '/ (Top Level Realm)' -> 'Data stores'\n\nand named 'opendj'.\n\nMany more relationships for both datastores and authentication services will be added in the future. \nAny contributions are welcome.\n\n## Scale out Usage\n\nOpenAM itself is highly scalable using built-in a site configuration option and can be used behind load balancers. This release of OpenAM do support it, but the autoscaling features supported by Juju is not currently mapped a OpenAM site configurations.\n\n## Known Limitations and Issues\n\nThis release of OpenAM is meant for evaluation purposes only and will violate the license terms if used in a production environment. There is no limitation in features of the product.\n\nThe 'unit-get public-address' call in Juju install hook needs to return a Fully Qualified Domain Name (FQDN), just an IP address will abort the installation if no FQDN alias is used.\n\nThe 'amadmin' password will only be set on initial installation. It is not supported to change it from within Juju with the current version of this charm.\n\nOther limitations for this charm:\n- Autoscaling is not supported in this charm release. You can add and configure it manually if needed.\n- Using privileged ports (low ports numbers) are not supported\n- Only OpenDJ is tested as a user repository for authenticate users\n- Only the Apache OpenAM Agent relationship is currently supported. Currently no support for the .Net and J2EE agents.\n- Only OpenID Connect is supported as a automatically way of authenticate users of any charm implementing the same interface \n\nThere will be more features and relationships to come.\n\n# Configuration\n\nIn addition to the license agreement and the admin password you can change or set the following configuration options.\n\nOpenAM uses the default Tomcat7 as it's java container for deployment. Default ports are 8080 and for SSL 8443 is used. There is a self-signed certificate created for SSL.\n\n- http_port, defaults to 8080\n- https_port, defaults to 8443\n- java_opts, defaults to '-Xmx1024m -XX:MaxPermSize=256m'\n\nYou can then browse to http://ip-address:8080 or https://ip-address:8443 to further configure OpenAM. Default admin user is \"amadmin\" and password is the one defined on deployment.\n\n# Contact Information\n\n- Stein Myrseth <stein.myrseth@forgerock.com>\n- [Github](https://github.com/justme99/juju)\n\n## ForgeRock\n- [ForgeRock Homepage](http://forgerock.com)\n- [ForgeRock Community](http://forgerock.org)\n",
  "readme_name": "README.md",
  "gatherbase_origin": "juju-charmstore"
}