{
  "name": "charon Chef cookbook",
  "chef_cookbook_name": "charon",
  "revision": "0.1.1",
  "uris": [
    "https://supermarket.chef.io/cookbooks/charon",
    "https://supermarket.chef.io/cookbooks/charon/download",
    "https://supermarket.chef.io/cookbooks/charon/versions/0.1.1",
    "https://supermarket.chef.io/cookbooks/charon/versions/0.1.1/download",
    "https://supermarket.chef.io/api/v1/cookbooks/charon/versions/0.1.1",
    "https://supermarket.chef.io/api/v1/cookbooks/charon",
    "https://supermarket.chef.io/api/v1/cookbooks/charon/versions/0.1.1/download"
  ],
  "labels": [
    "Chef cookbook",
    "Utilities",
    "Executable/Script/Chef Cookbook",
    "Binding/Provider/Microsoft/Azure",
    "Mode/Executable/Script/Chef Cookbook",
    "Type/Infrastructure/Operating System"
  ],
  "info_url": "https://supermarket.chef.io/cookbooks/charon",
  "package_url": "https://supermarket.chef.io/api/v1/cookbooks/charon/versions/0.1.1/download",
  "deprecated": false,
  "created": "2013-09-26T18:31:51.000Z",
  "updated": "2013-09-26T18:31:51.000Z",
  "description": "Installs/Configures the Microsoft SQL Server 2008+ Azure Data Sync Agent and Pre-requisites",
  "maintainer": {
    "name": "cixelsyd",
    "email": "support@smashrun.com"
  },
  "license": "Apache 2.0",
  "chef_foodcritic_failure": null,
  "chef_up_for_adoption": null,
  "rating": null,
  "followers_count": 3,
  "downloads_count": 1214616,
  "downloads_count_revision": 1214617,
  "latest": true,
  "gatherbase_origin": "chef-supermarket",
  "readme_name": "README.md",
  "readme": "Description\n===========\n\nWindows Azure control panel:\nhttps://manage.windowsazure.com/\n\nFAQ (SQL Data Sync):\nhttp://msdn.microsoft.com/en-us/library/windowsazure/hh667301.aspx\n\nSync Team Blog:\nhttp://blogs.msdn.com/b/sync/\n\nThis cookbook will install dotnet4fx and/or dotnet45fx, along with the pre-requisites to the Windows Azure software for MSSQL.\n\n\nRequirements\n============\n\nUsing MSSQL Azure with a hosted MSSQL database: First, ENSURE your workstation's silverlight install is up to date... Otherwise, you will not be able to use the Azure admin web control panel.\n\nPrerequisites to installing the sync agent: dotnet4fx, windows installer 4.5 and then two SQL packages (clrtypes and shared management objects).  The dependency on my winstaller cookbook provides the requisite windows installer version.  Charon should successfully install the latest version of all the pre-requisites.  Note, documentation of Data Sync prior to the October 2012 Preview was confusing when it came to which specific version of SQL pre-requisites to install, however, this has been clarified in recent documentation.\n\nAs of now, The Data Sync Agent does NOT have an unattended/silent install... So Charon simply installs the prerequisites and the datasync bits and then quits.  Please be aware, that as this is pre-release software (and it shows!), there are a few minor \"gotchas,\" even while installing manually.  During the manual install, ensure that you use a fully-qualified account name (neither \"user\" nor \".\\user\" works properly... only \"hostname\\user\" is correct).  The user will need \"logon as a service\" permissions as well.\n\nFrequently Encountered Problems:\nhttp://msdn.microsoft.com/en-us/library/windowsazure/hh667321.aspx#bkmk_notsufficientprivileges\n\nInstall sync agent \nhttp://msdn.microsoft.com/en-us/library/hh667304.aspx#bkmk_installagent\nhttp://msdn.microsoft.com/en-us/library/windowsazure/hh667308\n\n\nPrerequisites\n\nPrior to Configuring a Sync Group\n\n1.Provisioned a SQL Data Sync server – Provision an Azure Sync Server.\nhttp://msdn.microsoft.com/en-us/library/hh667324.aspx\n\n- If there is no SQL Database server you need to create one.\n- enable access to the hosting SQL Database by SQL Data Sync by setting the source hosted server's firewall rules (maybe not necessary?).\n- enable access to the azure SQL Database by SQL Data Sync by setting the azure server's firewall rules.\n On the firewall rules page check the Allow other Windows Azure services to access this server checkbox is checked. (Figure 2.1)\n- Note!  the new Azure portal that was released in Oct/Nov 2012 does NOT contain the \"Data Sync Server\" UI!  Craaaazy, I know. See this article for details (basically, you need to switch back to the old portal to find the proper UI):\nhttp://blogs.msdn.com/b/sync/archive/2012/10/28/where-in-the-world-is-sql-data-sync.aspx\n\n2.Created and name the sync group – Name a Sync Group.\nhttp://msdn.microsoft.com/en-us/library/windowsazure/hh667311.aspx\n\n\n3.Added a SQL Database hub database to the sync group –Add a Windows Azure SQL Database as the Hub. \n\n\n4.Added one or more other databases to the sync group.\n\n\nAdd SQL Database instances – Add a Windows Azure SQL Database as a Member.\nAdd SQL Server databases – Add a SQL Server Member Database.\n\n\n\nAttributes\n==========\n\nThe very few attributes inside this cookbook serve mostly to point at installation media.\n\nUsage\n=====\n\nAdd the charon::default recipe to your run list, and it will install dotnet4fx, the datasync pre-requisites, and then download the datasync bits.  As of the initial version of this cookbook, no unattended installation of the datasync software was possible... So the cookbook quits at that point.  This cookbook can also install dotnet45fx if desired (for standalone dotnet45fx installation, just add charon::dotnet45fx to the run list).",
  "requires": [
    {
      "kind": "host",
      "label": "windows",
      "revision": ">= 0.0.0",
      "one_of_group": "os"
    },
    {
      "kind": "env",
      "uri": "https://supermarket.chef.io/cookbooks/winstaller",
      "revision": ">= 0.0.6",
      "self_resolve": true
    }
  ]
}