{
  "name": "cis_centos6 Chef cookbook",
  "chef_cookbook_name": "cis_centos6",
  "revision": "0.5.0",
  "uris": [
    "https://supermarket.chef.io/cookbooks/cis_centos6",
    "https://supermarket.chef.io/cookbooks/cis_centos6/download",
    "https://supermarket.chef.io/cookbooks/cis_centos6/versions/0.5.0",
    "https://supermarket.chef.io/cookbooks/cis_centos6/versions/0.5.0/download",
    "https://supermarket.chef.io/api/v1/cookbooks/cis_centos6/versions/0.5.0",
    "https://supermarket.chef.io/api/v1/cookbooks/cis_centos6",
    "https://supermarket.chef.io/api/v1/cookbooks/cis_centos6/versions/0.5.0/download"
  ],
  "labels": [
    "Chef cookbook",
    "Operating Systems & Virtualization",
    "Executable/Script/Chef Cookbook",
    "Mode/Executable/Script/Chef Cookbook",
    "Type/Infrastructure/Operating System/Linux/CentOS"
  ],
  "info_url": "https://supermarket.chef.io/cookbooks/cis_centos6",
  "package_url": "https://supermarket.chef.io/api/v1/cookbooks/cis_centos6/versions/0.5.0/download",
  "deprecated": false,
  "created": "2016-03-24T09:52:46.397Z",
  "updated": "2016-03-24T10:35:20.495Z",
  "description": "This cookbook implements server hardening as specified by the CIS Benchmark for CentOS 6, version 1.1.0.",
  "maintainer": {
    "name": "huddle",
    "email": "help@huddle.com"
  },
  "license": "MIT",
  "chef_foodcritic_failure": false,
  "chef_up_for_adoption": false,
  "rating": null,
  "followers_count": 1,
  "downloads_count": 734,
  "downloads_count_revision": 202,
  "repository_url": "https://github.com/Huddle/cis_centos6",
  "issues_url": "https://github.com/Huddle/cis_centos6/issues",
  "chef_source_url": "https://github.com/Huddle/cis_centos6",
  "gatherbase_origin": "chef-supermarket",
  "readme_name": "README.md",
  "readme": "# CIS CentOS 6 Cookbook\n\nThis cookbook implements server hardening as specified by the [CIS Benchmark for CentOS 6, version 1.1.0](https://benchmarks.cisecurity.org/downloads/show-single/?file=centos6.110). The sections of the benchmark are largely split into different recipes:\n\n* 1. Install Updates, Patches and Additional Security Software - `recipes/additional_security.rb`, `recipes/filesystem.rb`\n* 2. OS Services - `recipes/legacy_services.rb`\n* 3. Special Purpose Services - `recipes/special_purpose_services.rb`\n* 4. Network Configuration and Firewalls - `recipes/network.rb`\n* 5. Logging and Auditing - `recipes/logging.rb`\n* 6. System Access, Authentication and Authorization - `recipes/cron.rb`, `recipes/sshd.rb`, `recipes/pam.rb`\n* 7. User Accounts and Environment - `recipes/environment.rb`\n* 8. Warning Banners - `recipes/banners.rb`\n* 9. System Maintenance - `recipes/system_file_permissions.rb`\n\nThis cookbook cannot cover everything in the benchmark. For example server maintenance tasks like \"1.2.3 Obtain Software Package Updates with yum\" or auditing tasks like \"9.1.1 Verify System File Permissions\". It does aim to cover all server configuration items that can be done during the course of a Chef run.\n\nIt is recommended that you reboot the system after applying changes for the first time as some changes require a system reboot to take effect.\n\n## Pre-requisites\n\nThis cookbook does not perform partitioning of the filesystem. This will need to be done before the cookbook is run so that the filesystem recipe can apply updates to those entries in the fstab. See section 1.1 of the benchmark for details of which filesystems to create. The filesystem recipe will apply the options.\n\nThis cookbook enables iptables (as required by the benchmark) but does not configure any rules. Consider configuring firewall rules with another cookbook, for example the [firewall](https://supermarket.chef.io/cookbooks/firewall) cookbook.\n\n## Attributes\n\nNot all servers will be able to support all parts of the benchmark being applied. Most of the attributes are provided to customise or disable sections of the hardening. All of the hardening is enabled by default.\n\n## Testing\n\nThis cookbook has been applied to servers and tested using [Nessus](https://www.tenable.com/products/nessus-vulnerability-scanner) to ensure that the benchmark items have been implemented correctly.\n\nIt has been tested with Chef 12.7.2 but may work with earlier releases. It should work with later (minor) releases.\n\nThere is not currently any unit testing, integration testing or style linting.\n\n## License\n\nThe cookbook is licensed under the MIT license:\n\n    The MIT License (MIT)\n\n    Copyright (c) 2016 Huddle\n\n    Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\n    The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n",
  "requires": [
    {
      "kind": "host",
      "label": "centos",
      "revision": "~> 6.7",
      "one_of_group": "os"
    }
  ]
}