{
  "name": "octopus-deploy Chef cookbook",
  "chef_cookbook_name": "octopus-deploy",
  "revision": "0.7.0",
  "uris": [
    "https://supermarket.chef.io/cookbooks/octopus-deploy",
    "https://supermarket.chef.io/cookbooks/octopus-deploy/download",
    "https://supermarket.chef.io/cookbooks/octopus-deploy/versions/0.7.0",
    "https://supermarket.chef.io/cookbooks/octopus-deploy/versions/0.7.0/download",
    "https://supermarket.chef.io/api/v1/cookbooks/octopus-deploy/versions/0.7.0",
    "https://supermarket.chef.io/api/v1/cookbooks/octopus-deploy",
    "https://supermarket.chef.io/api/v1/cookbooks/octopus-deploy/versions/0.7.0/download"
  ],
  "labels": [
    "Chef cookbook",
    "Other",
    "Executable/Script/Chef Cookbook",
    "Binding/Region/North America/US",
    "Mode/Executable/Script/Chef Cookbook"
  ],
  "info_url": "https://supermarket.chef.io/cookbooks/octopus-deploy",
  "package_url": "https://supermarket.chef.io/api/v1/cookbooks/octopus-deploy/versions/0.7.0/download",
  "deprecated": false,
  "created": "2015-09-02T22:50:35.008Z",
  "updated": "2016-10-04T14:15:06.441Z",
  "description": "Handles installing Octopus Deploy Server &| Tentacle",
  "maintainer": {
    "name": "bigbam505",
    "email": "BMontague@cvent.com"
  },
  "license": "Apache 2.0",
  "chef_foodcritic_failure": false,
  "chef_up_for_adoption": null,
  "rating": null,
  "followers_count": 6,
  "downloads_count": 3681,
  "downloads_count_revision": 94,
  "repository_url": "https://github.com/cvent/octopus-deploy-cookbook",
  "issues_url": "https://github.com/cvent/octopus-deploy-cookbook/issues",
  "chef_source_url": "https://github.com/cvent/octopus-deploy-cookbook",
  "latest": true,
  "gatherbase_origin": "chef-supermarket",
  "readme_name": "README.md",
  "readme": "Octopus Deploy Cookbook\n=======================\n\n[![Cookbook Converge](https://img.shields.io/appveyor/ci/bigbam505/octopus-deploy-cookbook/master.svg?style=flat-square&label=appveyor)](https://ci.appveyor.com/project/bigbam505/octopus-deploy-cookbook) [![Build Status](https://img.shields.io/travis/cvent/octopus-deploy-cookbook/master.svg?style=flat-square&label=travis)](https://travis-ci.org/cvent/octopus-deploy-cookbook) [![Code Climate](https://img.shields.io/codeclimate/github/cvent/octopus-deploy-cookbook.svg?style=flat-square)](https://codeclimate.com/github/cvent/octopus-deploy-cookbook) [![Chef cookbook](https://img.shields.io/cookbook/v/octopus-deploy.svg?style=flat-square)](https://supermarket.chef.io/cookbooks/octopus-deploy) [![GitHub license](https://img.shields.io/badge/license-Apache%202.0-blue.svg?style=flat-square)](https://github.com/cvent/octopus-deploy-cookbook/blob/master/LICENSE)\n\nThis cookbook is used for installing the [Octopus Deploy](http://octopusdeploy.com) server and tentacle on Microsoft Windows machines.\n\n\n## NOTICE: Pre-Release\nThis is pre release and there will be major changes to this before its final release.  The recipes for installation and configuration will be switched into resources so people can use the library easier. Once this is found stable it will be released as version 1.0.0, until this point lock down to any minor version that you use.\n\n## Resource/Provider\n### octopus_deploy_server\n#### Actions\n- :install: Install a version of Octopus Deploy server\n- :configure: Install a version of Octopus Deploy server and configure it\n- :remove: Uninstall a version of the Octopus Deploy Server if it is installed\n\n#### Attribute Parameters\n- :instance: Name attribute. The Octopus Deploy Server instance name (used for configuring the instance not install)\n- :version: Required. The version of Octopus Deploy Server to install\n- :checksum: The SHA256 checksum of the Octopus Deploy Server msi file to verify download\n- :home_path: The Octopus Deploy Server home directory (Defaults to C:\\Octopus)\n- :config_path: The Octopus Deploy Server config file path (Defaults to C:\\Octopus\\OctopusServer.config)\n- :connection_string: The Octopus Deploy Server connection string to the MSSQL Server instance\n- :master_key: The Octopus Deploy Server master key for encryption, leave blank to generate one at creation\n- :node_name: The Octopus Deploy Server Node Name, will default to machine hostname\n- :create_database: Whether Octopus Deploy Server should create the database with the connection string provided (Defaults to false)\n- :admin_user: A default admin in AD for the Octopus Deploy Server to create\n- :license: The raw license key for Octopus Deploy Server to use\n- :start_service: Whether to start the Octopus Deploy Server service after creation of the instance (Defaults to True)\n\n#### Example\nInstall version 3.1.1 of Octopus Deploy Server\n\n```ruby\noctopus_deploy_server 'OctopusServer' do\n  action :install\n  version '3.1.1'\n  checksum '<SHA256-checksum>'\nend\n```\n\n### octopus_deploy_tentacle\n#### Actions\n- :install: Install a version of Octopus Deploy Tentacle (Default)\n- :configure: Configure an instance of the octopus Deploy tentacle\n- :register: Register Tentacle with Octopus Deploy Server\n- :remove: Remove an instance of the Octopus Deploy Tentacle\n- :uninstall: Uninstall a version of the Octopus Deploy Tentacle if it is installed\n\n#### Attribute Parameters\n- :instance: Name attribute. The Octopus Deploy Tentacle instance name (used for configuring the instance not install)\n- :version: Required. The version of Octopus Deploy Tentacle to install\n- :checksum: The SHA256 checksum of the Octopus Deploy Tentacle msi file to verify download\n- :home_path: The Octopus Deploy Instance home directory (Defaults to C:\\Octopus)\n- :config_path: The Octopus Deploy Instance config file path (Defaults to C:\\Octopus\\Tentacle.config)\n- :app_path: The Octopus Deploy Instance application directory (Defaults to C:\\Octopus\\Applications)\n- :trusted_cert: The Octopus Deploy Instance trusted Server cert\n- :port: The Octopus Deploy Instance port to listen on for listening tentacle (Defaults to 10933)\n- :configure_firewall: Whether cookbook will open firewall on listen tentacles (Defaults to false)\n- :polling: Whether this Octopus Deploy Instance is a polling tentacle (Defaults to False)\n- :cert_file: Where to export the Octopus Deploy Instance cert (Defaults to C:\\Octopus\\tentacle_cert.txt)\n- :upgrades_enabled: Whether to upgrade or downgrade the tentacle version if the windows installer version does not match what is provided in the resource. (Defaults to True)\n- :server: Url to Octopus Deploy Server (e.g https://octopus.example.com)\n- :api_key: Api Key used to register Tentacle to Octopus Server\n- :roles: Array of roles to apply to Tentacle when registering with Octopus Deploy Server (e.g [\"web-server\",\"app-server\"]) \n- :environment: Which environment or environments the Tentacle will become part of when registering with Octopus Deploy Server (Defaults to node.chef_environment). Accepts string or array.\n- :tenants: Optional array of tenants to add to the tentacle. Tenant must already exist on Octopus Deploy Server. Requires Octopus 3.4\n- :tenant_tags: Optional array of tenant tags to add to the tentacle. Tags must already exist on Octopus Deploy Server. If tag is part of a tag group, include the group name followed by a slash `<groupname>/<tag>`. e.g ( Priority/VIP, Datacenter/US ).. Requires Octopus 3.4\n\n#### Examples\n\n##### Install version 3.2.24 of Octopus Deploy Tentacle\n\nThis will simply install the version of the tentacle that is specified.\n\n```ruby\noctopus_deploy_tentacle 'Tentacle' do\n  action :install\n  version '3.2.24'\n  checksum '147f84241c912da1c8fceaa6bda6c9baf980a77e55e61537880238feb3b7000a'\nend\n```\n\n##### Install version 3.2.24 of Octopus Deploy Tentacle and configure it\n\nThis will install the tentacle and then configure the tentacle on the machine to communicate with the Octopus Deploy server.  It can also update firewall rules if enabled.\n\n```ruby\noctopus_deploy_tentacle 'Tentacle' do\n  action [:install, :configure]\n  version '3.2.24'\n  checksum '147f84241c912da1c8fceaa6bda6c9baf980a77e55e61537880238feb3b7000a'\n  trusted_cert 'b5b7ea6537852fb5b7ea6537852f3428'\n  # You can enable this resource to update firewall rules as well\n  configure_firewall true\nend\n```\n\n##### Register Listening Tentacle with the Octopus Deploy Server\n\nThis will check if the tentacle is registered on the Octopus Deploy server and if it is not will register the tentacle in the environment with the tags that are specified.\n\n```ruby\n# You will first need to generate an api key\n# In Octopus Deploy Server GUI click your Name -> Profile -> API keys\noctopus_deploy_tentacle 'Tentacle' do\n  action :register\n  server 'https://octopus.example.com'\n  api_key '12345678910'\n  roles ['database']\n  # You can set polling to true for a polling tentacle setup\n  # polling true\nend\n```\n\n\n## Assumptions\n\nOne major assumption of this cookbook is that you already have .net40 installed on your server.  If you do not then you might need to do that before this cookbook. In addition, some of the resources in here require Chef version 12 in order to work.\n\n\n## Known Issues\nThis does not work with Octopus Deploy versions less than 3.2.3 because of a bug in [exporting tentacle certificates](https://github.com/OctopusDeploy/Issues/issues/2143)\n\nTentacle roles are only used the first time a Tentacle is registered with an Octopus Deploy Server. Updating tentacle roles in cookbook will not update roles on Octopus Deploy Server.\n\nRegistering multiple tentacles on the same machine is not supported.\n\nSwitching Tentacle modes between 'polling' & 'listening' is not currently supported.\n\n\nLicense and Author\n==================\n\n* Author:: Brent Montague (<bmontague@cvent.com>)\n\nCopyright:: 2015, Cvent, Inc.\n\nLicensed under the Apache License, Version 2.0 (the \"License\");\nyou may not use this file except in compliance with the License.\nYou may obtain a copy of the License at\n\n    http://www.apache.org/licenses/LICENSE-2.0\n\nUnless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\nSee the License for the specific language governing permissions and\nlimitations under the License.\n\nPlease refer to the [license](LICENSE) file for more license information.\n",
  "requires": [
    {
      "kind": "host",
      "label": "windows",
      "revision": ">= 0.0.0",
      "one_of_group": "os"
    },
    {
      "kind": "env",
      "uri": "https://supermarket.chef.io/cookbooks/windows",
      "revision": ">= 1.38.0",
      "self_resolve": true
    },
    {
      "kind": "env",
      "uri": "https://supermarket.chef.io/cookbooks/windows_firewall",
      "revision": "~> 3.0",
      "self_resolve": true
    }
  ]
}